# ExternallyTaggedNonBRep Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedNonBRep Methods
ExternallyTaggedNonBRep Class See Also
---
The ExternallyTaggedNonBRep type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from ExternallyTaggedGeometryObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetUsage | Controls the usage of this ExternallyTaggedNonBRep. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExternallyTaggedNonBRep Class
Autodesk.Revit.DB Namespace